app/views/canciones/_form.html.erb

    <%= f.text_field :precio, prepend: "$", append: ".00" %>
    <%= f.select :disco_id, options_for_select(Disco.all.map { |d| [d.nombre, d.id] }) %>
---
SELECT "discos".* FROM "discos"