app/views/discos/_form.html.erb

SELECT "artistas".* FROM "artistas"
SELECT "generos".* FROM "generos"
SELECT "discograficas".* FROM "discograficas"
---
    <%= f.text_field :precio, prepend: "$", append: ".00" %>
	<%= f.select :artista_id, options_for_select(Artista.all.map {|a| [a.nombre, a.id ]})%>
	<%= f.select :genero_id, options_for_select(Genero.all.map {|g| [g.nombre, g.id ]})%>
    <%= f.select :discografica_id, options_for_select(Discografica.all.map {|d| [d.nombre, d.id ]})%>