app/controllers/artistas_controller.rb

SELECT "artistas".* FROM "artistas"
---
  def index
    @artistas = Artista.all

SELECT "discos".* FROM "discos"  WHERE "discos"."artista_id" = ?  ORDER BY "discos"."publicacion" DESC  [["artista_id", 1]]
---
  def show
    @discos = @artista.discos.order(:publicacion => :desc)

INSERT INTO "artistas" ("created_at", "descripcion", "fecha_origen", "nombre", "updated_at", "web") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-10-29 02:28:55.171169"], ["descripcion", ""], ["fecha_origen", "2015-10-29"], ["nombre", "Metallica"], ["updated_at", "2015-10-29 02:28:55.171169"], ["web", ""]]
---
  def create
    @artista = Artista.new(artista_params)

    respond_to do |format|
      authorize! :create, @artista
      if @artista.save

UPDATE "artistas" SET "imagen" = ?, "updated_at" = ? WHERE "artistas"."id" = 1  [["imagen", "metallica.jpg"], ["updated_at", "2015-10-30 22:24:42.603685"]]
---
  def update
    respond_to do |format|
      if @artista.update(artista_params)

SELECT  "artistas".* FROM "artistas"  WHERE "artistas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_artista
      @artista = Artista.find(params[:id])