app/controllers/discos_controller.rb

  def index
    @generos = Genero.all.order(:nombre).first(6)
    @artistas = Artista.all.order(:nombre).first(12)
---
SELECT  "artistas".* FROM "artistas"   ORDER BY "artistas"."nombre" ASC LIMIT 12