app/controllers/discograficas_controller.rb

  def index
    @discograficas = Discografica.all
---
SELECT "discograficas".* FROM "discograficas"

  def create
    @discografica = Discografica.new(discografica_params)

    respond_to do |format|
      if @discografica.save
---
INSERT INTO "discograficas" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-10-29 02:17:53.950927"], ["descripcion", "Descripcion"], ["nombre", "Elektra"], ["updated_at", "2015-10-29 02:17:53.950927"]]

    def set_discografica
      @discografica = Discografica.find(params[:id])
---
SELECT  "discograficas".* FROM "discograficas"  WHERE "discograficas"."id" = ? LIMIT 1  [["id", 1]]