app/controllers/discos_controller.rb

  def index
    @generos = Genero.all
    if params[:genero_id].nil?
      @genero = Genero.first
    else
      @genero = Genero.find_by(id: params[:genero_id])
    end
    @discos = @genero.discos.order(:nombre => :asc)
---
SELECT "generos".* FROM "generos"
SELECT  "generos".* FROM "generos"   ORDER BY "generos"."id" ASC LIMIT 6
SELECT  "generos".* FROM "generos"  WHERE "generos"."id" = 3 LIMIT 1
SELECT  "generos".* FROM "generos"   ORDER BY "generos"."nombre" ASC LIMIT 6
SELECT "discos".* FROM "discos"  WHERE "discos"."genero_id" = ?  ORDER BY "discos"."nombre" DESC  [["genero_id", 1]]

  def show
    @canciones = @disco.canciones
    @duracion = @canciones.sum(:duracion)
---
SELECT "canciones".* FROM "canciones"  WHERE "canciones"."disco_id" = ?  [["disco_id", 5]]
SELECT SUM("canciones"."duracion") AS sum_id FROM "canciones"  WHERE "canciones"."disco_id" = ?  [["disco_id", 14]]

  def create
    @disco = Disco.new(disco_params)

    respond_to do |format|
      authorize! :create, @disco
      if @disco.save
---
INSERT INTO "discos" ("artista_id", "created_at", "nombre", "portada_delantera", "publicacion", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artista_id", 1], ["created_at", "2015-10-30 01:00:03.812899"], ["nombre", ""], ["portada_delantera", "538.jpg"], ["publicacion", "2015-10-30"], ["updated_at", "2015-10-30 01:00:03.812899"]]

  def update
    respond_to do |format|
      authorize! :create, @disco
      if @disco.update(disco_params)
---
UPDATE "discos" SET "artista_id" = ?, "genero_id" = ?, "portada_delantera" = ?, "updated_at" = ? WHERE "discos"."id" = 8  [["artista_id", 1], ["genero_id", 1], ["portada_delantera", "dreaming.jpg"], ["updated_at", "2015-10-30 22:39:45.485964"]]

    def set_disco
      @disco = Disco.find(params[:id])
---
SELECT  "discos".* FROM "discos"  WHERE "discos"."id" = ? LIMIT 1  [["id", 5]]