app/controllers/generos_controller.rb

SELECT "generos".* FROM "generos"
---
  def index
    @generos = Genero.all

INSERT INTO "generos" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-10-29 01:31:12.808912"], ["descripcion", "Descripción del genero Rock"], ["nombre", "Rock"], ["updated_at", "2015-10-29 01:31:12.808912"]]
---
  def create
    @genero = Genero.new(genero_params)

    respond_to do |format|
      if @genero.save

UPDATE "generos" SET "imagen" = ?, "updated_at" = ? WHERE "generos"."id" = 1  [["imagen", "rock.jpg"], ["updated_at", "2015-10-30 22:12:12.996884"]]
---
  def update
    respond_to do |format|
      if @genero.update(genero_params)

DELETE FROM "generos" WHERE "generos"."id" = ?  [["id", 2]]
---
  def destroy
    @genero.destroy

SELECT  "generos".* FROM "generos"  WHERE "generos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_genero
      @genero = Genero.find(params[:id])