app/controllers/welcome_controller.rb

SELECT  "generos".* FROM "generos"   ORDER BY "generos"."nombre" ASC LIMIT 6
SELECT  "artistas".* FROM "artistas"   ORDER BY "artistas"."nombre" ASC LIMIT 12
SELECT  "discos".* FROM "discos"   ORDER BY "discos"."nombre" ASC LIMIT 12
---
  def index
    @generos = Genero.all.order(:nombre).first(6)
    @artistas = Artista.all.order(:nombre).first(12)
    @discos = Disco.all.order(:nombre).first(12)